Repository: AbrorKhurramov/resident
Catalog: lib/l10n/app_*.arb
Languages: uz

# json_cast_failure_error_message
source: something went wrong!
uz: nosozliklar mavjud!

# internet_failure_message
source: internet not connected
uz: internet tarmog`ida nosozliklar

source: error message not found
uz: xato xabari topilmadi

# server_error_message
source: something wrong with server
uz: serverda nosozliklar!

# login_error_message
source: login or password is wrong!
uz: login yoki parol xato!

source: language
uz: til

source: select language
uz: tilni tanlang

# appeal_type
source: type of appeal
uz: murojaat turi

source: no internet connection
uz: internet aloqasi yo'q

# check_your_internet
source: please check your internet connection and try again
uz: internet aloqangizni tekshiring va qaytadan urinib ko'ring

source: try again
uz: qayta urinish

# install_software_update
source: please install software update !
uz: iltimos dastur yangilanishini o'rnating !

# install_update
source: install the update
uz: yangilanishni o'rnatish

source: payment date:
uz: to'lov sanasi:

source: offline
uz: oflayn

# answer_from_housing_and_communal_services
source: response from the housing and communal services
uz: uy-joy kommunal xizmatlaridan javob

# survey_under_development
source: the survey is under development
uz: So`rovnoma ishlab chiqarish jarayonida

source: all
uz: barchasi

source: open
uz: ochish

source: address
uz: manzil

source: commission
uz: komissiya

source: total amount
uz: umumiy summa

source: categories
uz: toifalar

source: first name
uz: ism

source: last name
uz: familiya

source: profile image
uz: profil rasmi

# to_come
source: enter
uz: kirish

# login_hint_label
source: enter login
uz: login kiriting

source: password
uz: parol

# password_hint_label
source: enter password
uz: parol kiriting

# enter
source: login
uz: kirish

# change_admin_password
source: The password you entered is temporary, for security reasons, you must change it to your personal
uz: Siz kiritgan parol vaqtinchalik, xavfsizlik nuqtai nazaridan uni shaxsiy parolingizga o'zgartirishingiz kerak

# change_admin_phone
source: Please add your phone number
uz: Iltimos, telefon raqamingizni kiriting

# phone
source: phone number
uz: telefon raqam

# come_up_pin_code
source: create pin code
uz: pin kod o`ylab toping

source: confirm pin code
uz: pin kodni qayta kiriting

# enter_pin_code
source: enter PIN or biometrics
uz: pin kod yoki biometriya kiriting

source: forgot password
uz: pin-kod unutildi

# enter_current_pin_code
source: enter your current pin code
uz: joriy pin-kodni kiriting

source: set up pin code
uz: pin-kodni o`rnatish

source: enter new pin code
uz: yangi pin-kod kiriting

source: current password
uz: joriy parol

# current_password_hint_label
source: enter current password
uz: joriy parolni kiriting

source: new password
uz: yangi parol

# new_password_hint_label
source: enter new password
uz: yangi parolni kiriting

source: confirm password
uz: parolni qayta kiriting

# confirm_password_hint_label
source: re-enter the new password
uz: yangi parolni qayta kiriting

source: save
uz: saqlash

# pin_code_success_setup
source: pin code updated successfully
uz: pin-kod muvaffaqiyatli yangilandi

# enter_active_pin_code
source: enter current pin code
uz: joriy pin-kodni kiriting

# error_active_pin_code
source: active pin error
uz: joriy pin-kod xatosi

# error_confirm_pin_code
source: pin-code is incorrect
uz: pin-kod noto'g'ri terilgan

# error_different_pin_code
source: pin-codes don't match
uz: terilgan pin-kodlar har xil

# error_different_password
source: passwords don`t match
uz: terilgan parollar bir xil emas

# error_length_password
source: The length of the dialed passwords must be at least 3 characters
uz: terilgan parollar uzunligi kamida 3 belgi bo'lishi kerak

source: send
uz: yuborish

source: attach file
uz: fayl biriktirish

# appeal
source: appeals
uz: murojaatlar

# write_appeal
source: write an appeal
uz: murojaat qilish

# history_appeal
source: appeals history
uz: murojaatlar tarixi

source: close
uz: yopish

source: attached files
uz: biriktirilgan fayllar

source: status
uz: holati

source: appeal date
uz: murojaat sanasi

source: date and time
uz: sana va vaqt

source: date
uz: sana

# day
source: d.
uz: kun

# hour
source: h.
uz: soat

# minute
source: min.
uz: daq.

# second
source: sec.
uz: sek.

source: good day
uz: hayrli kun

source: my card
uz: meni kartam

source: replenishment history
uz: to`ldirish tarixi

# top_up_balance
source: replenish the balance
uz: balans to`ldirish

source: security
uz: xavfsizlik

source: log out
uz: tizimdan chiqish

source: notifications
uz: bildirishnomalar

# doings
source: events
uz: xizmatlar

source: invoices
uz: invoyslar

source: make_reservation
uz: bron qilish

# select_date_reservation
source: select reservation date
uz: bron vaqtini tanlang

# wish
source: wishes
uz: istaklar

source: write your wish
uz: istaklaringizni yozib qoldiring

# add_card
source: adding card
uz: karta qo`shish

source: card number
uz: karta raqami

source: card expiry date
uz: karta amal qilish muddati

source: add
uz: qo`shish

# confirm_action
source: confirm the action
uz: tasdiqlash

# sms_number_info
source: SMS confirmation code was sent to the number {phone_number}
uz: tasdiqlash kodi SMS orqali {phone_number} raqamiga yuborildi

# filter_date
source: from {date_from} to {date_to}
uz: {date_from} dan {date_to} gacha

source: confirm
uz: tasdiqlash

# go_back
source: back
uz: orqaga qaytish

source: my apartments
uz: meni kvartiralarim

# detailing
source: payment detail
uz: to'lov tafsilotlari

source: transaction number
uz: tranzaksiya raqami

source: payment method
uz: to'lov usuli

# top_up_amount
source: replenishment amount
uz: to'lov miqdori

source: successfully
uz: muvaffaqiyatli

# paid_successfully
source: payment was successful
uz: to'lov muvaffaqiyatli amalga oshirildi

# replenishment_check
source: replenishment
uz: hisobni to'ldirish

source: change password
uz: parolni o'zgartirish

source: personal data
uz: shaxsiy ma'lumotlar

source: login by biometrics
uz: biometriya orqali kirish

# login_biometrics_required
source: biometric authentication is required!
uz: biometriya orqali kirish talab qilinadi!

source: verify identity
uz: shaxsingizni tasdiqlang

source: apartment balance
uz: kvartira balansi

# sum
source: UZS
uz: so`m

source: personal account
uz: shaxsiy hisob raqam

source: residential complex
uz: turar-joy kompleksi

source: house
uz: uy

source: floor
uz: qavat

source: delete card
uz: kartani o`chirish

# delete_card_info
source: are you sure to delete the card?
uz: kartani o`chirishda ishonchingiz komilmi?

source: cancel
uz: bekor qilish

source: delete
uz: o`chirish

source: top up
uz: to'ldirish

source: balance replenished successfully
uz: balans muvaffaqiyatli to'ldirildi

# card_added_successfully
source: card successfully added
uz: karta muvaffaqiyatli qo'shildi

# card_delete_successfully
source: card successfully deleted
uz: karta muvaffaqiyatli o`chirildi

# log_out_info
source: are you sure to log out?
uz: tizimdan chiqishda ishonchingiz komilmi?

source: exit
uz: chiqish

source: from
uz: dan

source: to
uz: gacha

source: paid
uz: to`landi

source: awaiting payment
uz: to`lov jarayonda

source: canceled
uz: bekor qilish

# balance_not_have_amount
source: Apartment balance is not enough
uz: Kvartira balansida mablag` yetarli emas

# flat
source: apartment
uz: Kvartira

source: office
uz: ofis

source: gas
uz: gaz

source: cold water
uz: sovuq suv

source: hot water
uz: issiq suv

source: electricity
uz: elektr tarmoq

# others
source: other services
uz: boshqa xizmatlar

source: services
uz: xizmatlar

# electricity_description
source: not included to the tariff services of the complex
uz: turar-joy kompleksi tariflari xizmatlariga taalluqli emas

# outstanding_debt
source: debt
uz: to'lanmagan qarz

# update_counter
source: update the counter
uz: hisoblagichni yangilang

# amount_debt
source: debt
uz: qarz

source: balance
uz: balans

source: counter
uz: hisoblagich

source: indication
uz: ko`rsatkichlar

source: counter indication
uz: hisoblagichni ko`rsatkichi

# history_indication
source: indication history
uz: ko`rsatkichlar tarixi

source: current indication
uz: joriy ko`rsatkich

source: enter last indication
uz: oxirgi ko`rsatkichlarni kiriting

source: enter counter indication
uz: hisoblagich ko`rsatkichlarini kiriting

source: support
uz: texnik yordam

source: support phone
uz: texnik yordam raqami

# write_telegram
source: write on telegram
uz: telegramdan yozish

source: application developers
uz: ilova dasturchilariga

source: survey
uz: so`rovnoma

source: vote
uz: ovoz berish

# you_must_vote_before
source: need to vote before
uz: ovoz berish muddati

# see_result
source: see the results
uz: natijani ko'ring

source: voted
uz: ovoz bergan

source: residents
uz: rezidentlar

source: back
uz: orqaga

source: next
uz: oldinga

source: you have already voted
uz: siz ovoz bergansiz

source: choose your answer
uz: javob variantini tanlang

source: your voice
uz: sizni javobingiz

# thanks_for_vote
source: thanks for voting
uz: javobingiz uchun raxmat

source: something went wrong!
uz: nosozliklar mavjud!

# find_out_results
source: look at the results
uz: natijalarni ko`rish

# flat_info
source: apartment info
uz: kvartira haqida malumot

source: documents
uz: hujjatlar

source: pay
uz: to`lamoq

source: filter
uz: filtr

source: reset
uz: qayta o`rnatish

source: ready
uz: tayyor

# new_status
source: new
uz: yangi

# under_consideration
source: in progress
uz: ko`rib chiqilmoqda

source: accepted
uz: qabul qilindi

source: not accepted
uz: qabul qilinmadi

source: completed
uz: tugallangan

source: Fitness Club
uz: Fitnes klubi

# fitness_label
source: Premium fitness equipment from an Italian brand with a worldwide reputation. European quality of every detail in the highest quality simulators.
uz: Dunyo bo'ylab obro'ga ega bo'lgan italyan brendining premium fitnes uskunalari. Eng yuqori sifatli simulyatorlarda har bir detalning Yevropa sifati.

source: invoice number
uz: invoys raqami

source: date of issue
uz: berilgan sana

source: date is incorrect
uz: sana noto`g`ri kiritlgan

source: scan your face
uz: yuzingizni skanerlang

# empty_apartment_description
source: at the moment you do not have any added apartment
uz: hozirda sizda kvartira qo`shilmagan

# empty_replenish_balance_description
source: to replenish the balance you need to add a card
uz: balansni to'ldirish uchun kartani qo'shishingiz kerak

# empty_replenish_balance_history
source: Payment history will appear immediately after payment
uz: To'lov tarixi to'lovdan so'ng darhol paydo bo'ladi

# empty_service_description
source: different types of services will be available here soon
uz: tez orada bu yerda turli xil xizmatlar taqdim etiladi

# empty_history_appeal_description
source: appeals are absent
uz: murojaatlar mavjud emas

# empty_invoice_description
source: there is no information in this section yet
uz: bu bo'limda hali hech qanday ma'lumot yo'q

# empty_survey_description
source: there is no information in this section yet
uz: bu bo'limda hali hech qanday ma'lumot yo'q

# empty_document
source: there is no information in this section yet
uz: bu bo'limda hali hech qanday ma'lumot yo'q

source: January
uz: Yanvar

source: February
uz: Fevral

source: March
uz: Mart

source: April
uz: Aprel

source: June
uz: Iyun

source: July
uz: Iyul

source: August
uz: Avgust

source: September
uz: Sentabr

source: October
uz: Oktabr

source: November
uz: Noyabr

source: December
uz: Dekabr
